InformationRegisters/ЦветаОформления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦветаОформления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЦветаОформления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЦветаОформления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсПродажи</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document._ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрПроцент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>счеКонсигнация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкуРазрешил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>стрПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>счКонсигнация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/глСервер/Ext/Module.bsl
Функция глПриСозданииНаСервереЭлемент(Форма, Объект) Экспорт

	МожноКод = гоЕстьРоль("РазрешитьКодыСправочников");
	
	Имя = Объект.Ссылка.Метаданные().Имя;
	
	//2016.05.15 + Аптеки
	//Если НЕ гоЭто("Пользователи, Валюты, Аптеки", Имя) Тогда
	Если НЕ гоЭто("Пользователи, Валюты", Имя) Тогда
		Попытка
			Форма.Элементы.Код.Видимость = МожноКод;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Если гоЭто("Контрагенты, Номенклатура", Имя) Тогда
		Попытка
			Форма.Элементы.Родитель.Видимость = Ложь;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Попытка
		Форма.Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	Исключение
	КонецПопытки; 
	
	Если гоЭто("Фирмы", Имя) Тогда
		Попытка
			Форма.Элементы.Префикс.ТолькоПросмотр = НЕ гоАдминистратор();
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Если гоЭто("Партии", Имя) Тогда
		Попытка
			Форма.Элементы.Серия.Видимость = гоФирма().ВыводитьСерия;
			Форма.Элементы.СрокГодности.Видимость = гоФирма().ВыводитьСрокГодности;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Если гоЭто("Номенклатура", Имя) Тогда
		Попытка
			Форма.Элементы.УчетПоСериям.Видимость = гоФирма().ВыводитьСерия;
			Форма.Элементы.Производитель.Видимость = гоФирма().ВыводитьПроизводитель;
		Исключение
		КонецПопытки; 
	
		//2016.05.24
		//флаг услуг нужно проверить на движения, если ссылка уже есть
		//если услуги были как товар, то найдет
		//но если услуги были как услуги, то движений не будет здесь
		//если когда-то мы сделаем обороты услуг, сможем там смотреть
		//2016.07.15 + И (НЕ Объект.ЭтоГруппа)
		Если ЗначениеЗаполнено(Объект.Ссылка) И (НЕ Объект.ЭтоГруппа) Тогда
			Форма.Элементы.ТипНоменклатуры.ТолькоПросмотр = омСервер.ЕстьДвиженияНоменклатуры(Объект.Ссылка) 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Истина;
КонецФункции

Функция глПриСозданииНаСервереСписок(Форма) Экспорт
	Можно = гоЕстьРоль("РазрешитьНастройкуСписка");
	МожноФорму = гоЕстьРоль("РазрешитьИзменятьФорму");
	МожноКод = гоЕстьРоль("РазрешитьКодыСправочников");
	
	Имя = "";
	Попытка
		Имя = СтрЗаменить(Форма.Список.ОсновнаяТаблица, "Справочник.", "");
	Исключение
	КонецПопытки; 
	
	//хочу везде код спрятать
	Попытка
		Форма.Элементы.Код.Видимость = МожноКод;
	Исключение
	КонецПопытки; 
	
	//и команду настройки формы
	Попытка
		Форма.Элементы.ФормаИзменитьФорму.Видимость = МожноФорму;
		Форма.Элементы.ФормаНастройкаСписка.Видимость = Можно;
		
		Форма.Элементы.ФормаОбновить.ТолькоВоВсехДействиях = Ложь;
		Форма.Элементы.ФормаОбновить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Исключение
	КонецПопытки; 
	
	Если гоЭто("Партии", Имя) Тогда
		Попытка
			Форма.Элементы.Серия.Видимость = гоФирма().ВыводитьСерия;
			Форма.Элементы.СрокГодности.Видимость = гоФирма().ВыводитьСрокГодности;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Если гоЭто("Номенклатура", Имя) Тогда
		Попытка
			Форма.Элементы.УчетПоСериям.Видимость = гоФирма().ВыводитьСерия;
			Форма.Элементы.Производитель.Видимость = гоФирма().ВыводитьПроизводитель;
		Исключение
		КонецПопытки; 
		
		Попытка
			Форма.Элементы.Остаток.Формат = "ЧДЦ=" + гоФирма().ЧислоЗнаковКоличество;
			Форма.Элементы.Резерв.Формат = "ЧДЦ=" + гоФирма().ЧислоЗнаковКоличество;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	//2016.01.30
	//это отключит окошко для поиска, которое не дает пользоваться старым вариантом поиска, когда при первой букве появляется окно
	Попытка
		Форма.Элементы.Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
	Исключение
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции

Функция глПрефикс(Фирма, ДСчет = 0) Экспорт
	Прф = "";
	Попытка
		Прф = СокрЛП(Фирма.Префикс);
	Исключение
	    Прф = "";
	КонецПопытки; 
	Если Прф = "" Тогда Прф = "ФР" КонецЕсли; 
	
	ПрфДоп = "";
	Если НЕ (ДСчет = 0) Тогда  
		Попытка
			ПрфДоп = СокрЛП(ДСчет.Префикс);
		Исключение
			ПрфДоп = "";
		КонецПопытки; 
		Если ПрфДоп = "" Тогда ПрфДоп = "ДС" КонецЕсли; 
	КонецЕсли; 
	
	Возврат Прф + ПрфДоп;
КонецФункции

Функция глПрефиксДефис(Фирма, ДСчет = 0) Экспорт
	Возврат глПрефикс(Фирма, ДСчет) + "-";
КонецФункции

// © Primus1C  13.03.2026  НАЧАЛО ► 

Функция глЗапретЗаписиПоДате(ДокументСсылка) Экспорт
	
	Если ДокументСсылка.Дата = Дата(1,1,1) Тогда
		Возврат Ложь;
	КонецЕсли;
	лДатаЗапрета = гоПараметрСеанса("ДатаЗапретаРедактирования");
	Если лДатаЗапрета <> Дата(1,1,1) И ДокументСсылка.Дата <= КонецДня(лДатаЗапрета) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции     

// © Primus1C  ОКОНЧАНИЕ ◄

Процедура глЗаписатьОбщиеРеквизиты(Объект) Экспорт

	Если НЕ ЗначениеЗаполнено(Объект.Фирма) Тогда Объект.Фирма = гоФирма() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.КемСоздан) Тогда Объект.КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Создан) Тогда Объект.Создан = ТекущаяДатаСеанса() КонецЕсли; 
	Объект.КемСохранен = гоПользователь();
	Объект.Сохранен = ТекущаяДатаСеанса();

КонецПроцедуры

Функция глОплатаЧем(Регистратор, СуммаПрихода, СуммаРасхода) Экспорт
	Попытка
		КолвоПривязок = Регистратор.Привязки.Количество();
	Исключение
		КолвоПривязок = 0;
	КонецПопытки; 
	
	Рез = Документы.РасходнаяНакладная.ПустаяСсылка();
	Сум = ?(СуммаПрихода = 0, СуммаРасхода, СуммаПрихода);
	
	Если НЕ (КолвоПривязок = 0) Тогда
		Для Каждого Строка Из Регистратор.Привязки Цикл
			Если Строка.Сумма1 = Сум Тогда  
				Рез = Строка.Док2;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Рез;
КонецФункции

Процедура глВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) Экспорт
	Ш = Макет.ПолучитьОбласть(Область); 
	Ш.Параметры.Заполнить(Параметры);  
	Если Уровень=Неопределено Тогда
		Таб.Вывести(Ш);
	Иначе
		Таб.Вывести(Ш, Уровень);
	КонецЕсли;
КонецПроцедуры

Процедура глПрисоединитьСекцию(Таб, Макет, Область, Параметры) Экспорт
	Ш = Макет.ПолучитьОбласть(Область); 
	Ш.Параметры.Заполнить(Параметры); 
	Таб.Присоединить(Ш);
КонецПроцедуры

Процедура глПовторятьПриПечатиСтроки(Таб, НумС, НумПо, ФиксСверху = 0) Экспорт
	Таб.ПовторятьПриПечатиСтроки = Таб.Область("R" + НумС + ":R" + НумПо);	//работает нормально
	
	Если ФиксСверху = 0 Тогда Возврат КонецЕсли; 
	
	Таб.ФиксацияСверху = ФиксСверху;
КонецПроцедуры

Процедура глПараметрыСтраницы(Таб, Ор = 1, Масштаб = -1, РежимПечатиКопий = -1, ПолеСлева = -1, ПолеСправа = -1, ПолеСверху = -1, ПолеСнизу = -1, КолонтитулСверху = -1, КолонтитулСнизу = -1, Автомасштаб = -1) Экспорт
	//еще там были <ФлагЧБПечати>,<ИмяПринтера>)

	Таб.ОриентацияСтраницы = ?(Ор = 1, ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
	
	Если НЕ (Масштаб = -1) Тогда Таб.МасштабПечати = Масштаб КонецЕсли;
	Если НЕ (РежимПечатиКопий = -1) Тогда Таб.РазборПоКопиям = (РежимПечатиКопий = 1) КонецЕсли;
	Если НЕ (ПолеСлева = -1) Тогда Таб.ПолеСлева = ПолеСлева КонецЕсли;
	Если НЕ (ПолеСправа = -1) Тогда Таб.ПолеСправа = ПолеСправа КонецЕсли;
	Если НЕ (ПолеСверху = -1) Тогда Таб.ПолеСверху = ПолеСверху КонецЕсли;
	Если НЕ (ПолеСнизу = -1) Тогда Таб.ПолеСнизу = ПолеСнизу КонецЕсли;
	Если НЕ (КолонтитулСверху = -1) Тогда Таб.РазмерКолонтитулаСверху = КолонтитулСверху КонецЕсли;
	Если НЕ (КолонтитулСнизу = -1) Тогда Таб.РазмерКолонтитулаСнизу = КолонтитулСнизу КонецЕсли;
	Если НЕ (Автомасштаб = -1) Тогда Таб.АвтоМасштаб = Автомасштаб КонецЕсли;
КонецПроцедуры

Процедура глОпции(Таб, ВыводСетки = -1, ВыводЗаголовков = -1, ФиксСтрок = -1, ФиксСтолбцов = -1, ИмяОпцийПечати = -1) Экспорт	//<ИмяСохрРазмОкна>,<ФлагЧБПросмотра>,<НаправлПерехода>)
	Если НЕ (ВыводСетки = -1) Тогда Таб.ОтображатьСетку = ВыводСетки КонецЕсли; 
	Если НЕ (ВыводЗаголовков = -1) Тогда Таб.ОтображатьЗаголовки = ВыводЗаголовков КонецЕсли; 
	Если НЕ (ФиксСтрок = -1) Тогда Таб.ФиксацияСверху = ФиксСтрок КонецЕсли; 
	Если НЕ (ФиксСтолбцов = -1) Тогда Таб.ФиксацияСлева = ФиксСтолбцов КонецЕсли; 
	Если НЕ (ИмяОпцийПечати = -1) Тогда Таб.КлючПараметровПечати = ИмяОпцийПечати КонецЕсли; 
КонецПроцедуры

Процедура глПокраситьСостояние(Форма, ИмяДокумента) Экспорт
	//Кра = 0; 
	//Зел = 0;
	//Син = 0;
	ФормаСписок = Форма["Список"];
	ИмяПоля = "Состояние";
	
	// © Primus1C  06.11.2023  НАЧАЛО ►   
	
	ИмяГруппыНастроек = ?(гоЭто("ДвижениеДенег, ВозвратПоставщику, ВозвратПокупателя", ИмяДокумента), "Предоплаты", "Долги");
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("НаименованиеГруппы", ИмяГруппыНастроек); 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Настройка.ИмяПредопределенныхДанных КАК Настройка,
	             |	ЦветаОформления.Значение КАК Значение
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Значение <> """"
	             |	И ЦветаОформления.Настройка.Родитель.Наименование = &НаименованиеГруппы";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		Если ИмяГруппыНастроек = "Предоплаты" Тогда
			ЗначениеПеречисления = Перечисления.Предоплаты[Выборка.Настройка];
		Иначе // долги
			ЗначениеПеречисления = Перечисления.Долги[СтрЗаменить(Выборка.Настройка, "Долг_", "")];
		КонецЕсли;
		
		Эле = ФормаСписок.УсловноеОформление.Элементы.Добавить();
		Эле.Использование = Истина;
		Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Значение));
		Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование 	= Истина;
		Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
		Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		Отб.ПравоеЗначение 	= ЗначениеПеречисления;
		Пол = Эле.Поля.Элементы.Добавить();
		Пол.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
	КонецЦикла;
	возврат;
		 
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	////////2015.12.24 + , ВозвратПоставщику, ВозвратПокупателя
	//////ТЧ = ?(гоЭто("ДвижениеДенег, ВозвратПоставщику, ВозвратПокупателя", ИмяДокумента), гоФирма().ЦветаПредоплаты, гоФирма().ЦветаДолги);
	//////
	//////Для Каждого Стр Из ТЧ Цикл
	//////	Эле = ФормаСписок.УсловноеОформление.Элементы.Добавить();
	//////	Эле.ИдентификаторПользовательскойНастройки = "Состояние" + Стр.Параметр;
	//////	Эле.Представление = "Состояние " + Стр.Параметр;
	//////	Эле.Использование = Истина;
	//////	Эле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
	//////	
	//////	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//////	Отб.Использование = Истина;
	//////	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	//////	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	//////	Отб.ПравоеЗначение = Стр.Параметр;

	//////	Пол = Эле.Поля.Элементы.Добавить();
	//////	Пол.Использование = Истина;
	//////	Пол.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	//////	
	//////	// © Primus1C  12.08.2023  НАЧАЛО ►
	//////	//гоЦветОбратно(Стр.Цвет, Кра, Зел, Син);  
	//////	//Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(Кра, Зел, Син));
	//////	Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Стр.ЦветРГБ));
	//////	// © Primus1C  ОКОНЧАНИЕ ◄
	//////КонецЦикла; 
	
КонецПроцедуры	

Процедура глПокраситьВалюты(Форма, ИмяПоля, ИмяСписка = "") Экспорт

	ФормаСписок = Форма[?(ИмяСписка = "", "Список", ИмяСписка)];
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Валюты.Ссылка КАК Ссылка,
	             |	Валюты.Код КАК Код,
	             |	Валюты.Обозначение КАК Обозначение
	             |ИЗ
	             |	Справочник.Валюты КАК Валюты";
	Выборка = Справочники.Валюты.Выбрать();  
	Пока Выборка.Следующий() Цикл  
		
		Эле = ФормаСписок.УсловноеОформление.Элементы.Добавить();
		//Эле.ИдентификаторПользовательскойНастройки = "Цвет" + Выборка.Код;
		//Эле.Представление = "Цвет " + Выборка.Код;
		Эле.Использование = Истина;
		//Эле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
		
		Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		Отб.ПравоеЗначение = ?(ИмяПоля = "Обозначение", Выборка.Обозначение, Выборка.Ссылка);
		
		Пол = Эле.Поля.Элементы.Добавить();
		Пол.Использование = Истина;
		Пол.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
		Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.ЦветРГБ)); 
		
	КонецЦикла;     
	
КонецПроцедуры

Процедура глПокраситьВалютыТЗ(Форма, ИмяПоля, ПутьКДанным) Экспорт
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Валюты.Ссылка КАК Ссылка,
	             |	Валюты.Код КАК Код,
	             |	Валюты.Обозначение КАК Обозначение
	             |ИЗ
	             |	Справочник.Валюты КАК Валюты";
	Выборка = Справочники.Валюты.Выбрать();  
	Пока Выборка.Следующий() Цикл 
		
		ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.ЦветРГБ));
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ПутьКДанным);
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Выборка.Ссылка;
		ЭлементОтбора.Использование 	= Истина;
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(ИмяПоля);
		ОформляемоеПоле.Использование 	= Истина;
		
	КонецЦикла;     

КонецПроцедуры	
	
// © Primus1C  16.08.2023  НАЧАЛО ►  

Процедура глПокраситьСтатусы(Форма, ИмяСписка = "Список", Статус = Ложь, СтатусИнспекции = Ложь, СтатусОплаты = Ложь, СтатусПродажи = Ложь) Экспорт
	
	СписокНаФорме = Форма[ИмяСписка];
	
	Запр = Новый Запрос; 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Значение КАК Цвет,
	             |	ЦветаОформления.Настройка.ИмяПредопределенныхДанных КАК Статус
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Настройка.Родитель = &ГруппаНастроек
	             |	И ЦветаОформления.Значение <> """"";
	
	Если Статус Тогда
		
		//Выборка = Справочники.СтатусыИнвойсов.Выбрать();
		//Пока Выборка.Следующий() Цикл   
		//	Если Выборка.ПометкаУдаления Тогда
		//		Продолжить;
		//	КонецЕсли; 
		//	
		//	Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
		//	//Эле.ИдентификаторПользовательскойНастройки = "Статус" + СтрЗаменить(Выборка.Наименование, " ", "");
		//	//Эле.Представление 		= "Статус " + Выборка.Наименование;
		//	Эле.Использование 		= Истина;
		//	//Эле.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
		//	
		//	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	Отб.Использование 	= Истина;
		//	Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Статус");
		//	Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		//	Отб.ПравоеЗначение 	= Выборка.Ссылка;
		//	
		//	Пол = Эле.Поля.Элементы.Добавить();
		//	Пол.Использование 	= Истина;
		//	Пол.Поле 			= Новый ПолеКомпоновкиДанных("Статус");
		//	
		//	Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.ЦветРГБ));
		//	
		//КонецЦикла;
		
		Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыИнвойсов);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
			Эле.Использование 		= Истина;
			Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отб.Использование 	= Истина;
			Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Статус");
			Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
			Отб.ПравоеЗначение 	= Перечисления.СтатусыИнвойса[Выборка.Статус];
			
			Пол = Эле.Поля.Элементы.Добавить();
			Пол.Использование 	= Истина;
			Пол.Поле 			= Новый ПолеКомпоновкиДанных("Статус");
			
			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		
		КонецЦикла;
		
		Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыПривязкиИнвойсов);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
			Эле.Использование 		= Истина;
			Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отб.Использование 	= Истина;
			Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Состояние");
			Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
			Отб.ПравоеЗначение 	= Перечисления.Долги[СтрЗаменить(Выборка.Статус,"Инв_","")];
			
			Пол = Эле.Поля.Элементы.Добавить();
			Пол.Использование 	= Истина;
			Пол.Поле 			= Новый ПолеКомпоновкиДанных("Состояние");
			
			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		
		КонецЦикла;

	КонецЕсли;
	
	Если СтатусИнспекции Тогда
		
		//Для каждого П Из Метаданные.Перечисления.СтатусыИнспекции.ЗначенияПеречисления Цикл  
		//	ЗначениеПеречисления = Перечисления.СтатусыИнспекции[П.Имя];
		//	
		//	Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
		//	Эле.Использование 	= Истина;
		//	
		//	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	Отб.Использование 	= Истина;
		//	Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусИнспекции");
		//	Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		//	Отб.ПравоеЗначение 	= ЗначениеПеречисления;
		//	
		//	Пол = Эле.Поля.Элементы.Добавить();
		//	Пол.Использование 	= Истина;
		//	Пол.Поле 			= Новый ПолеКомпоновкиДанных("СтатусИнспекции");
		//	
		//	//Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", Перечисления.СтатусыИнспекции.ЦветСтатуса(ЗначениеПеречисления));    
		//	Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка(П.Имя));    
		//	
		//КонецЦикла;	
		
		Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыИнспекцииИнвойсов);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
			Эле.Использование 		= Истина;
			Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отб.Использование 	= Истина;
			Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусИнспекции");
			Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
			Отб.ПравоеЗначение 	= Перечисления.СтатусыИнспекции[Выборка.Статус];
			
			Пол = Эле.Поля.Элементы.Добавить();
			Пол.Использование 	= Истина;
			Пол.Поле 			= Новый ПолеКомпоновкиДанных("СтатусИнспекции");
			
			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		
		КонецЦикла;

	КонецЕсли;
	
	Если СтатусОплаты Тогда
	
		//Для каждого П Из Метаданные.Перечисления.СтатусыОплаты.ЗначенияПеречисления Цикл  
		//	ЗначениеПеречисления = Перечисления.СтатусыОплаты[П.Имя];
		//	
		//	Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
		//	Эле.Использование 	= Истина;
		//	
		//	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	Отб.Использование 	= Истина;
		//	Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусОплаты");
		//	Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		//	Отб.ПравоеЗначение 	= ЗначениеПеречисления;
		//	
		//	Пол = Эле.Поля.Элементы.Добавить();
		//	Пол.Использование 	= Истина;
		//	Пол.Поле 			= Новый ПолеКомпоновкиДанных("СтатусОплаты");
		//	
		//	//Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", Перечисления.СтатусыОплаты.ЦветСтатуса(ЗначениеПеречисления));    
		//	Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка(П.Имя));    

		//КонецЦикла;	
	
		Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыОплатыИнвойсов);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
			Эле.Использование 		= Истина;
			Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отб.Использование 	= Истина;
			Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусОплаты");
			Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
			Отб.ПравоеЗначение 	= Перечисления.СтатусыОплаты[Выборка.Статус];
			
			Пол = Эле.Поля.Элементы.Добавить();
			Пол.Использование 	= Истина;
			Пол.Поле 			= Новый ПолеКомпоновкиДанных("СтатусОплаты");
			
			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		
		КонецЦикла;

	КонецЕсли;

	Если СтатусПродажи Тогда

		Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыИнвойсовПродажи);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Эле = СписокНаФорме.УсловноеОформление.Элементы.Добавить();
			Эле.Использование 		= Истина;
			Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отб.Использование 	= Истина;
			Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Состояние");
			Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
			Отб.ПравоеЗначение 	= Перечисления.СтатусыОплаты[Выборка.Статус];
			
			Пол = Эле.Поля.Элементы.Добавить();
			Пол.Использование 	= Истина;
			Пол.Поле 			= Новый ПолеКомпоновкиДанных("Состояние");
			
			Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура глПокраситьПомеченныеНаУдаление(Форма, ИмяСписка = "Список") Экспорт

	ФормаСписок = Форма[ИмяСписка];	
	
	Эле = ФормаСписок.УсловноеОформление.Элементы.Добавить();
	Эле.ИдентификаторПользовательскойНастройки = "ПометкаУдаления";
	Эле.Представление = "ПометкаУдаления";
	Эле.Использование = Истина;
	Эле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
		
	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование = Истина;
	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	Отб.ПравоеЗначение = Истина;

	Пол = Эле.Поля.Элементы.Добавить();
	Пол.Использование = Истина;
	//Пол.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
	Эле.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноГрифельноСерый);

КонецПроцедуры

Процедура глПокраситьУслуги(Форма, ИмяСписка = "Список") Экспорт
	
	Если НЕ ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ВыделятьЦветомУслуги") Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка
		ФормаСписок = Форма[ИмяСписка];	
	Исключение
		ФормаСписок = Форма;	
	КонецПопытки;	
		
	Эле = ФормаСписок.УсловноеОформление.Элементы.Добавить();
	//Эле.ИдентификаторПользовательскойНастройки = "Услуги";
	//Эле.Представление = "Услуги";
	Эле.Использование = Истина;
	Эле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;	//Недоступный
		
	Отб = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование = Истина;
	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипНоменклатуры");
	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	Отб.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Услуга;

	Пол = Эле.Поля.Элементы.Добавить();
	Пол.Использование = Истина;
		
	Эле.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка("ЦветУслуг"));

КонецПроцедуры

Функция глПолучитьРеквизитыФормы(Форма) Экспорт

	Возврат Форма.ПолучитьРеквизиты();	

КонецФункции 

Процедура глУстановитьГраницуВидимости(Список) Экспорт

	Граница = гоПользователь().ГраницаПросмотра;	
	Если Граница <> Дата(1,1,1) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Граница", Граница);
	КонецЕсли;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

Процедура глУдалитьСтроки(Табл, Строки) Экспорт
//2016.01.31	
	
	Для Каждого Строка Из Строки Цикл Табл.Удалить(Строка) КонецЦикла; 
КонецПроцедуры
 
Процедура глНоваяКолонка(Табл, Имя, Стр = "", Дли = 0, Точ = 0, Неотр = Ложь) Экспорт
//2016.01.31	
	
	Если (Стр = "Число") И (Дли <> 0) Тогда
		
		Знак = ДопустимыйЗнак.Любой;
		Если Неотр Тогда Знак = ДопустимыйЗнак.Неотрицательный КонецЕсли; 
		
		Тип = Новый ОписаниеТипов(Стр, Новый КвалификаторыЧисла(Дли, Точ, Знак));
		
	ИначеЕсли (Стр = "Строка") И (Дли <> 0) Тогда
		
		//именно третьим параметром нужно писать
		Тип = Новый ОписаниеТипов(Стр, , Новый КвалификаторыСтроки(Дли));

	//2016.01.31	
	//добавляем без типа вообще, так тоже можно
	ИначеЕсли Стр = "" Тогда
	
		Табл.Колонки.Добавить(Имя);
		Возврат;
		
	Иначе
		
		Тип = Новый ОписаниеТипов(Стр);
		
	КонецЕсли; 
	
	Табл.Колонки.Добавить(Имя, Тип);
КонецПроцедуры

Процедура глДобавитьТабл(Стр, Кол, Зна) Экспорт
//2016.01.31	
	
	Было = Стр[Кол];
	Стр[Кол] = Было + Зна;
КонецПроцедуры

Функция глЭтоСимЦифра(Пер, НадоТочки = Ложь) Экспорт
	Если (Пер = ".") И НадоТочки Тогда Возврат Истина КонецЕсли; 
	Возврат (Пер >= "0") И (Пер <= "9");
КонецФункции

Функция глРазделитьЦифрыБуквы(Стр, НадоТочки = Ложь) Экспорт
	Рез = "";
	Дли = СтрДлина(Стр);
	
	СейчасЧто = -1;
	Для Н = 1 По Дли Цикл
		Сим = Сред(Стр, Н, 1);
		//надо точки - это хорошо, но точка не должна быть первой, а я видел, где ".30" и "ч . "
		//и точно она не должна быть последней, точнее, после цифры она еще число, а вот после буквы
		Что = глЭтоСимЦифра(Сим, НадоТочки);
		
		//бывает, что пришла точка и она определилась как цифра, но до этого была буква
		//а после буквы нам точка совсем не цифра
		Если (Н <> 1) И (Сим = ".") И Что И (НЕ СейчасЧто) Тогда Что = Ложь КонецЕсли; 
		
		//первый раз инициализируем
		Если СейчасЧто = -1 Тогда СейчасЧто = Что КонецЕсли; 
		
		//когда идет смена, вставляем пробел
		Если СейчасЧто <> Что Тогда 
			Рез = Рез + " ";
			СейчасЧто = Что;
		КонецЕсли; 
		
		//символ добавляем всегда
		Рез = Рез + Сим;
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции
 
Функция глСложныйАнализ(Имя) Экспорт
//2016.02.14
//мы хотим разделить цифры и буквы, нужна какая-то функция
//именно при загрузке нужно, чтобы изменения зафиксировались
//предлагается не просто так, а если слово начинается с цифры, точку внутри цифр тоже нужно считать цифрой, еще там может запятая
//можно сначала найти все запятые, если слева и справа цифры, то меняем на точку

	Стр = СокрЛП(Имя);
	Стр = СтрЗаменить(Стр, ";", ",");
	Стр = СтрЗаменить(Стр, """", "'");
	
	РС = Символы.ПС;
	//прежде всего нужно убрать РС, вдруг попали, можно и другие символы
	Стр = СтрЗаменить(Стр, РС, " ");
	Стр = СтрЗаменить(Стр, Символы.НПП, "");
	Стр = СтрЗаменить(Стр, Символы.Таб, "");
	
	//идея такая - можно легко получить список слов, потом каждое проанализируем
	//сначала нужно все двойные пробелы заменить на 1
	Пока Найти(Стр, "  ") Цикл Стр = СтрЗаменить(Стр, "  ", " ") КонецЦикла; 
	
	//теперь можно разделить на слова функцией по строкам, но сначала пробел меняем на РС
	Стр = СтрЗаменить(Стр, " ", РС);
	
	Рез = "";
	//обрабатываем все слова
	Ско = СтрЧислоСтрок(Стр);
	Для Н = 1 По Ско Цикл
		Сло = СтрПолучитьСтроку(Стр, Н);
		Если Сло = "" Тогда Продолжить КонецЕсли;
		
		//каждое слово мы хотим обработать
		//если оно начинается с цифры, то меняем запятые внутри на точки
		Пер = Лев(Сло, 1);
		НадоТочки = Ложь;
		Если глЭтоСимЦифра(Пер) Тогда 
			Сло = СтрЗаменить(Сло, ",", "."); 
			НадоТочки = Истина;
		КонецЕсли;
		
		//решили все слова разделять
		//задание посложнее, если внутри слова есть переход с цифр на буквы, то вставляем пробел
		Сло = глРазделитьЦифрыБуквы(Сло, НадоТочки);
		
		//после обработки складываем слова
		Рез = Рез + Сло + " ";
	КонецЦикла; 
	
	//чтобы ушел пробел в конце
	Возврат СокрЛП(Рез);
КонецФункции
